Revit 2027 API
WireTypeSet.Contains Method
Tests for the existence of a wire type within the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	WireType item
)
Public Overridable Function Contains (
	item As WireType
) As Boolean
public:
virtual bool Contains(
	WireType^ item
)
abstract Contains :
        item : WireType -> bool
override Contains :
        item : WireType -> bool
Parameters
item WireType
The wire type to be searched for.
Return Value
Boolean
The Contains method returns True if the wire type is within the set, otherwise False.
See Also
Reference
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace